<?php

/**
 * Індивідуальні налаштування Отримувачів оплати сервера/маркетплейса
 *
 */

return [
    [
        '_match' => [ // Шукаємо конкретний Payee
            'uid' => '00000000-0003-0000-0000-000000000001',
        ],
        '_add' => [ // Додаємо новий елемент до списка Вид оплат цього Отримувача коштів
            'pt' => [
                [
                    'type' => 'pt_online',      // тип оплати
                    'label' => 'Monobank',      // на цей раз через онлайн оплата monobank
                    'provider' => 'Monobank',
                ]
            ]
        ]
    ]
];
