<?php

/**
 * Індивідуальні налаштування аутентифікацій сервера/маркетплейса
 */

return [

    'Provider' => [
        //
        // Формат структури
        // 'назва_провайдера' => [     // назва провайдера може бути будь-яка, але унікальна. провайдер підв'язується до Продавця
        //     'ідентифікатор' => [    // ідентифікатор це UID Продавця або слово 'marketplace', щоб зробити провайдера доступним для всіх Продавців
        //         'enabled' => false, // false якщо забороняємо використовувати ці дані
        //        // дані
        //     ]
        // ],

        // наприклад,
        // 'Monobank' => [
        //    'marketplace' => [        // доступно для всього сайту та Продавців
        //        'class' => 'Monobank',
        //        'token' => '12345'
        //    ],
        //    'UID-Продавця' => [       // використовується лише для Продавця з ідентифікатором 'UID-Продавця'
        //        'class' => 'Monobank',
        //        'token' => '67890'
        //    ],
        //    'UID-Продавця2' => [       // використовується лише для Продавця з ідентифікатором 'UID-Продавця2'
        //        'enabled' => false,    // але так як тут "false", то будуть використані дані з ідентифікатором 'marketplace'
        //        'class' => 'Monobank',
        //        'token' => '666666'
        //    ],
        // ],


        /**
         * За замовчуванням прямий зв'язок з базою не використовується.
         * заповнюйте це за необхідності та отримуйте дані аутентифікації через Entity::get3thAuth('db','marketplace')
         */
        'db' => [
            'marketplace' => [
                'host' => '@_get(DB_SERVER_NAME)',
                'port' => '',
                'socket' => '', // '/var/lib/mysql/mysql.sock',
                'type' => 'mysql',
                'user' => 'user',
                'passwd' => 'passwd',
                'database' => 'database'
            ]
        ],

        /**
         * Розкоментйте цю секцію, щоб дозволити вхідні підключення до вашого сайту від Comba серверу
         * замінить REQUEST_KEY на ключ якій отримали після реєстрації магазину
         */
        //        'RequestApi' => [
        //            'marketplace' => [
        //                'REQUEST_KEY' => [
        //                    'ip' => '', // опціонально, заповніть це щоб обмежити підключення лише однією IP адресою
        //                    'server' => 'server_hostname', // опціонально, заповніть це щоб обмежити підключення лише з цієї доменної адреси
        //                ],
        //            ]
        //        ],

        /**
         * Провайдер reCaptcha
         * знайдіть свій ключ на https://www.google.com/recaptcha/admin/site/
         */
        'reCaptcha' => [
            'marketplace' => [
                'url' => 'https://www.google.com/recaptcha/api/siteverify',
                'key' => '',
                'secret' => '',
            ]
        ],

        /**
         * Провайдер Новапошта
         * знайдіть свій ключ в Персональному кабінеті Новапошта
         */
        'NovaPoshta' => [
            'marketplace' => [
                'key' => '',
                'phone' => ''
            ]
        ],

        /**
         * Провайдер AlphaSMS
         * знайдіть свій ключ в Персональному кабінеті AlphaSMS
         */
        'AlphaSMS' => [
            'marketplace' => [
                'login' => '+380',
                'pass' => '',
                'key' => '',
                'alias' => 'Назва'
            ]
        ],

        /**
         * Провайдер Liqpay
         * знайдіть свій ключ в Персональному кабінеті Liqpay
         */
        'LiqPay' => [
            'marketplace' => [
                'class' => 'LiqPay',
                'public_key' => '',
                'private_key' => ''
            ]
        ],

        /**
         * Провайдер Monobank
         * знайдіть свій токен в Персональному додатку monobank або на https://api.monobank.ua
         */
        'Monobank' => [
            'marketplace' => [
                'class' => 'Monobank',
                'token' => ''
            ]
        ],
    ]
];
