<?php

/**
 * Індивідуальні налаштування локального маркетплейса
 *
 * перейменуйте цей файл в marketplace.php щоб система почала його використовувати
 *
 * Скопіюйте з основного файлу /src/Config/marketplace.php
 * групу налаштувань які хочете переназначити,
 * наприклад групу 'Marketplace'
 */


return [
    'Marketplace' => [
        'uid' => '10000000-0001-0000-0000-000000000001', // ЗАМІНІТЬ цєй UID на реєстраційний UID якщо працюєте з Comba сервером
        'label' => 'Перший маркетплейс',
        'site' => COMBAMODX_SERVER_HOST,
        'email' => 'sales@' . COMBAMODX_SERVER_NAME,
        'emailinfo' => 'info@' . COMBAMODX_SERVER_NAME,
        'emailsupport' => 'support@' . COMBAMODX_SERVER_NAME,
        'icon' => '/assets/images/' . COMBAMODX_SERVER_NAME . '.jpg',

        // paall = true
        // Дозволити оплату для всіх замовленнь зі статусом Новий:
        // якщо в Замовлені всі товари в наявності - автоматично проставити статус Дозволено оплату
        // і показувати посилання на сторінку оплати одразу після оформлення замовлення
        'paall' => true,

        'sellers' => [
            ['uid' => '00000000-0002-0000-0000-000000000001'],
        ],
        'payee' => [
            ['uid' => '00000000-0003-0000-0000-000000000002']
        ]
    ],
];